<template>
  <div class="q-px-md">
    <h5 class="q-ma-none q-mb-md text-center">🚚 Доставка и оплата</h5>
    <div class="q-mb-md" v-for="(delivery, d) in deliveryData" :key="d" >
      <h6 class="text-center q-ma-none q-mb-sm">Зона доставки: {{ delivery.title }}</h6>
      <div class="justify-center row" v-for="(rule, r) in delivery.rules" :key="r">
        <span class="q-ma-none text-bold" :class="rule.isFree ? 'text-basic-green' : 'text-light-red'">{{ rule.condition }}: {{ rule.price }}</span>
      </div>
      <div class="border-bot q-pb-xs">
        <div class="text-light-gray" v-for="(area, a) in delivery.areas" :key="a">
          <div>Области: <span>{{ area }}</span></div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { reactive } from 'vue';

const deliveryData= reactive(
  [{
    title: 'Новый город',
    rules: [
      {condition: 'Заказ менее 1000 рублей', price: '300 рублей доставка.', isFree: false },
      {condition: 'от 1000 рублей', price: 'Бесплатно.', isFree: true }
    ],
    areas: [
      'Микрорайоны: 14-й, 15-й, 16-й, 17-й (включая ЖК «Жемчужина Зеленограда»).',
      'Микрорайоны: 18-й, 19-й, 20-й, 22-й (он же ЖК «Зелёный парк»).',
      'Микрорайон: 23-й (он же ЖК «Зелёный бор»).',
      'Населённые пункты: посёлок Малино, деревни Каменка, Кутузово, Ново-Малино и Рожки.'
    ]
  },
  {
    title: 'Старый город',
    rules: [
      { id: 1, condition: 'менее 1500 рублей', price: '500 рублей', isFree: false },
      { id: 2, condition: 'от 1500 рублей', price: 'Бесплатно', isFree: true }
    ],
    areas: [
      'Район Матушкино: 1-й, 2-й, 4-й микрорайоны и Северная промзона.',
      'Район Савёлки: 3-й, 5-й, 6-й, 7-й микрорайоны, микрорайон МЖК (5а), Восточная коммунальная зона («Восточка»), деревня Назарьево.',
      'Район Силино: 10-й, 11-й, 12-й микрорайоны, Западная промзона, промзона «Алабушево» (площадка ОЭЗ «Технополис Москва»).',
      'Район Старое Крюково: 8-й и 9-й микрорайоны, Южная промзона.',
      'Населённые пункты: Горетовка, Брехово, Бакеево, Андреевка, Голубое.'
    ]
  }]
);
</script>

<style scoped>

</style>
